<template>
  <div style="max-height: 600px;">
    <vue-event-calendar :events="demoEvents">
      <template scope="props">
        <div v-for="(event, index) in props.showEvents" class="event-item">
          <div v-show="event.show" class="event-title" @click="handleClick(event)">{{event.title}}</div>
          <div v-show="!event.show" class="event-desc" @click="handleClick(event)">{{event.desc}}</div>
          <div style="text-align: right">{{event.date}}</div>
        </div>
      </template>
    </vue-event-calendar>
  </div>
</template>

<script>
export default {
  name: 'Calendar',
  data () {
    return {
      demoEvents: [{
        date: '2018/12/14',
        title: '中铁集装箱运输有限责任公司招聘2019年应届高校毕业生',
        desc: '中铁集装箱运输有限责任公司成立于2003年11月，注册资本39亿元人民币，资产规模129亿元人民币。是经中华人民共和国国家工商行政管理总局注册，隶属中国铁路总公司的国有大型集装箱运输企业，是中国铁路总公司中欧班列统一经营服务平台，是中欧班列运输协调委员会秘书处单位。\n' +
          '公司主要负责集装箱购置、租赁、维修；铁路箱管理信息系统的开发、维护；集装箱国际、国内货运代理、接取送达、堆存保管；中欧中亚集装箱国际联运班列经营与客户服务等工作。\n' +
          '公司自成立以来，始终以打造世界一流现代物流企业为目标，秉承“诚信、担当、和合、创新”的企业精神，坚持“以市场需求为导向、以优质服务为追求、以客户满意为标准”的经营理念，依靠人才和信息化两大基础，积极推进中欧班列、多式联运、箱管箱修三大品牌建设，品牌效应和社会影响力不断扩大，公司先后获得荣获“AAAAA”级物流企业、中国服务业企业500强、全国先进物流企业和中国物流百强企业等荣誉称号。\n' +
          '公司下设哈尔滨、沈阳、北京、太原、呼和浩特、郑州、武汉、西安、济南、上海、南昌、广州、南宁、成都、昆明、兰州、乌鲁木齐18个分公司、36个营业部。对外投资企业13个，其中全资子公司2家（中铁国际多式联运有限公司、中铁集装箱哈萨克斯坦国际物流有限公司），控股子公司3家，参股子公司8家。公司是中外合资企业中铁联合国际集装箱有限公司和上市公司中铁铁龙集装箱物流股份有限公司的第一大股东，总部设在北京。',
        customClass: 'disabled highlight',
        show: true
      }, {
        date: '2018/12/19',
        title: '青川县2018年下半年引进（招聘）高层次人才',
        desc: '根据《广元市高层次人才引进暂行办法》（广委办〔2014〕38号）、《青川县高层次和紧缺人才引进暂行办法》（青委办〔2017〕147号）等文件规定，经研究，我县拟面向社会公开引进（招聘）61名高层次人才。现将有关事项公告如下。\n' +
          '一、引进（招聘）计划\n' +
          '本次公开引进（招聘）岗位均为事业单位在编在职岗位，名额为61名（详情见附件）。\n' +
          '二、报名条件\n' +
          '（一）基本条件\n' +
          '1.具有中华人民共和国国籍。\n' +
          '2.拥护中国共产党的领导，热爱社会主义祖国，遵纪守法，品行端正，有良好的职业道德，爱岗敬业，事业心和责任感强，服从组织安排。未参加国家禁止的组织及其活动。\n' +
          '3.具有较强的科研能力、管理能力和团队协作意识。\n' + '4.具备符合岗位要求的专业水平和工作能力。\n' +
          '5.身体健康。',
        customClass: 'disabled highlight',
        show: true
      }, {
        date: '2018/12/14',
        title: '成都地铁运营有限公司关于开展2019届毕业生面试合格人员体检的通知',
        desc: '按照公司招聘程序，现组织对面试合格的2019届毕业生开展体检工作，相关事项如下：\n' +
          '一、体检项目\n' +
          '（一）男性体检项目\n' +
          '身高、体重和血压；听力、眼科（含裸眼视力和矫正视力、辨色力）常规检查；内、外科常规检查；心电图；肝、胆、脾、胰、肾；血常规；肝功；肾功能；尿常规；血糖；胸透。\n' + '（二）女性体检项目\n' +
          '身高、体重和血压；听力、眼科（含裸眼视力和矫正视力、辨色力）常规检查；内、外科常规检查；心电图；肝、胆、脾、胰、肾；血常规；肝功；肾功能；尿常规、尿妊娠试验；血糖；胸透。\n' +
          '三、体检安排\n' +
          '（一）四川省内体检安排\n' +
          '如果您目前所在地为四川省内，建议在以下时间到成都市第三人民医院进行体检，费用自理。\n' +
          '1.体检时间\n' +
          '2018年12月16日-12月28日（含周六周日）上午7:00-10:00。\n' +
          '2.体检医院及地址\n' +
          '成都市第三人民医院地址：成都市青羊区署前街9号 ，距地铁1号线骡马市站A出口300m。\n' +
          '3.注意事项\n' +
          '（1）体检登记时请报成都地铁运营有限公司入职体检及本人姓名，并出示本人身份证原件。\n' +
          '（2）体检前不要剧烈运动，以清淡饮食为主，不要饮酒，保持空腹和充足睡眠。\n' +
          '（3）女性不要化妆和佩戴饰物，不穿连裤袜和高跟鞋，如在月经期内及时告知医生。\n' +
          '（二）四川省外体检安排\n' +
          '如果您目前所在地不在四川省内，请自行在当地三级甲等医院体检（体检项目及注意事项按上述相关体检要求进行），体检报告须粘贴本人照片并加盖体检机构公章,费用自理。\n' +
          '四、其他事项\n' +
          '1.成都市第三人民医院体检报告由医院统一收集交至公司；其他医院体检的人员请自行将体检报告邮寄至公司，并及时关注邮寄动态。\n' +
          '邮寄信息：四川省成都市成华区双店西一路208号成都地铁中环停车场办公楼A801，人力资源部招聘调配室吕先生，联系电话：028-61638868，邮编：610058。\n' +
          '2.体检报告接收截止时间：2018年12月29日17:00。\n' +
          '3.本次体检的结果，请及时关注学校就业信息网、公司官方网站发布的相关通知，并保持联系电话畅通。',
        customClass: 'disabled highlight',
        show: true
      }]
    }
  },
  methods: {
    handleClick (event) {
      event.show = !event.show
    }
  }
}
</script>

<style scoped>
  .event-title {
    text-align: center;
    font-size: 26px;
    cursor: pointer;
  }
  .event-desc {
    text-align: center;
    font-size: 20px;
    cursor: pointer;
  }
</style>
